import copy

def get_change_sign(word):
    """
        # sign['a'] =  # a à á â ã ạ ả ấ  ầ  ậ ắ  ặ
        # sign['e'] =  # è é ê  ẹ ẻ ẽ ế  ề  ể  ễ  ệ
        # sign['i'] =  # ì í ỉ ị
        # sign['o'] =  # ò ó ô  õ ọ ỏ  ố ồ  ổ ộ ớ ờ ỡ ợ
        # sign['u'] =  # ù ú ụ ủ ứ ừ ữ ự
        # sign['y'] =  # ý ỳ ỵ ỷ
    """
    sign_ = {}
    sign_['a'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ẫ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'a', 'ẵ', 'ẳ', 'ẩ']
    sign_['ă'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'a', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['à'] = ['a', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['á'] = ['à', 'a', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['â'] = ['à', 'á', 'a', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ã'] = ['à', 'á', 'â', 'a', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ạ'] = ['à', 'á', 'â', 'ã', 'a',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ả'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'a', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ấ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'a', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ầ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'a', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ậ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'a', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ắ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'a', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ặ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'a', 'a', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ằ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'a', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ắ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'a', 'ă', 'ẫ', 'ẵ', 'ẳ', 'ẩ']
    sign_['ẵ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'a', 'ẳ', 'ẩ']
    sign_['ẳ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'a', 'ẩ']
    sign_['ẩ'] = ['à', 'á', 'â', 'ã', 'ạ',
                  'ả', 'ấ', 'ầ', 'ậ', 'ắ', 'ặ', 'ằ', 'ắ', 'ă', 'ẫ', 'ẵ', 'ẳ', 'a']

    sign_['e'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['è'] = ['e', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['é'] = ['è', 'e', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['ê'] = ['è', 'é', 'e', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['ẹ'] = ['è', 'é', 'ê', 'e', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['ẻ'] = ['è', 'é', 'ê', 'ẹ', 'e', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['ẽ'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'e', 'ế', 'ề', 'ể', 'ễ', 'ệ']
    sign_['ế'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'e', 'ề', 'ể', 'ễ', 'ệ']
    sign_['ề'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'e', 'ể', 'ễ', 'ệ']
    sign_['ể'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'e', 'ễ', 'ệ']
    sign_['ễ'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'e', 'ệ']
    sign_['ệ'] = ['è', 'é', 'ê', 'ẹ', 'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ', 'e']
    sign_['i'] = ['ì', 'í', 'ỉ', 'ị', 'ĩ']
    sign_['ì'] = ['i', 'í', 'ỉ', 'ị', 'ĩ']
    sign_['í'] = ['ì', 'i', 'ỉ', 'ị', 'ĩ']
    sign_['ỉ'] = ['ì', 'í', 'i', 'ị', 'ĩ']
    sign_['ị'] = ['ì', 'í', 'ỉ', 'i', 'ĩ']
    sign_['ĩ'] = ['ì', 'í', 'ỉ', 'ị', 'i']
    sign_['o'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ỗ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'o']
    sign_['ò'] = ['o', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ó'] = ['ò', 'o', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ô'] = ['ò', 'ó', 'o', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['õ'] = ['ò', 'ó', 'ô', 'o', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ọ'] = ['ò', 'ó', 'ô', 'õ', 'o', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ỏ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'o',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ố'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'o', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ồ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'o', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ổ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'o', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ộ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'o', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ớ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'o', 'ờ', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ờ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'o', 'ỡ', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ỡ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'o', 'ợ', 'ở', 'ơ', 'ỗ']
    sign_['ợ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'o', 'ở', 'ơ', 'ỗ']
    sign_['ở'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ',
                  'ố', 'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'o', 'ơ', 'ỗ']
    sign_['ơ'] = ['ò', 'ó', 'ô', 'õ', 'ọ', 'ỏ', 'ố',
                  'ồ', 'ổ', 'ộ', 'ớ', 'ờ', 'ỡ', 'ợ', 'ở', 'o', 'ỗ']
    sign_['u'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ù'] = ['u', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ú'] = ['ù', 'u', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ụ'] = ['ù', 'ú', 'u', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ủ'] = ['ù', 'ú', 'ụ', 'u', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ứ'] = ['ù', 'ú', 'ụ', 'ủ', 'u', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ừ'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'u', 'ữ', 'ự', 'ư', 'ử', 'ũ']
    sign_['ữ'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'u', 'ự', 'ư', 'ử', 'ũ']
    sign_['ự'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'u', 'ư', 'ử', 'ũ']
    sign_['ư'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'u', 'ử', 'ũ']
    sign_['ử'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'u', 'ũ']
    sign_['ũ'] = ['ù', 'ú', 'ụ', 'ủ', 'ứ', 'ừ', 'ữ', 'ự', 'ư', 'ử', 'u']
    sign_['y'] = ['ý', 'ỳ', 'ỵ', 'ỷ', 'ỹ']
    sign_['ý'] = ['y', 'ỳ', 'ỵ', 'ỷ', 'ỹ']
    sign_['ỳ'] = ['ý', 'y', 'ỵ', 'ỷ', 'ỹ']
    sign_['ỵ'] = ['ý', 'ỳ', 'y', 'ỷ', 'ỹ']
    sign_['ỷ'] = ['ý', 'ỳ', 'ỵ', 'y', 'ỹ']
    sign_['ỹ'] = ['ý', 'ỳ', 'ỵ', 'ỷ', 'y']
    return sign_[word]


def get_prox_keys(word):
    array_prox = {}
    array_prox['a'] = ['q', 'w', 'z', 'x', 's']
    array_prox['b'] = ['v', 'f', 'g', 'h', 'n', ' ']
    array_prox['c'] = ['x', 's', 'd', 'f', 'v']
    array_prox['d'] = ['x', 's', 'w', 'e', 'r', 'f', 'v', 'c']
    array_prox['e'] = ['w', 's', 'd', 'f', 'r']
    array_prox['f'] = ['c', 'd', 'e', 'r', 't', 'g', 'b', 'v']
    array_prox['g'] = ['r', 'f', 'v', 't', 'b', 'y', 'h', 'n']
    array_prox['h'] = ['b', 'g', 't', 'y', 'u', 'j', 'm', 'n']
    array_prox['i'] = ['u', 'j', 'k', 'l', 'o']
    array_prox['j'] = ['n', 'h', 'y', 'u', 'i', 'k', 'm']
    array_prox['k'] = ['u', 'j', 'm', 'l', 'o']
    array_prox['l'] = ['p', 'o', 'i', 'k', 'm']
    array_prox['m'] = ['n', 'h', 'j', 'k', 'l']
    array_prox['n'] = ['b', 'g', 'h', 'j', 'm']
    array_prox['o'] = ['i', 'k', 'l', 'p']
    array_prox['p'] = ['o', 'l']
    array_prox['q'] = ['w', 'a']
    array_prox['r'] = ['e', 'd', 'f', 'g', 't']
    array_prox['s'] = ['q', 'w', 'e', 'z', 'x', 'c']
    array_prox['t'] = ['r', 'f', 'g', 'h', 'y']
    array_prox['u'] = ['y', 'h', 'j', 'k', 'i']
    array_prox['v'] = ['', 'c', 'd', 'f', 'g', 'b']
    array_prox['w'] = ['q', 'a', 's', 'd', 'e']
    array_prox['x'] = ['z', 'a', 's', 'd', 'c']
    array_prox['y'] = ['t', 'g', 'h', 'j', 'u']
    array_prox['z'] = ['x', 's', 'a']
    array_prox['1'] = ['q', 'w']
    array_prox['2'] = ['q', 'w', 'e']
    array_prox['3'] = ['w', 'e', 'r']
    array_prox['4'] = ['e', 'r', 't']
    array_prox['5'] = ['r', 't', 'y']
    array_prox['6'] = ['t', 'y', 'u']
    array_prox['7'] = ['y', 'u', 'i']
    array_prox['8'] = ['u', 'i', 'o']
    array_prox['9'] = ['i', 'o', 'p']
    array_prox['0'] = ['o', 'p']
    try:
        return array_prox[word]
    except:
        return word

def noise_telex(word):
        # cach 1: viet day du dau tai cho
    noise_tele = {'à': 'af', 'á': 'as', 'ã': 'ax', 'ạ': 'aj', 'ả': 'ar',
                  'â': 'aa', 'ấ': ['aas', 'asa'], 'ầ': ['aaf', 'afa'], 'ẫ': ['aax', 'axa'], 'ẩ': ['aar', 'ara'], 'ậ': ['aaj', 'aja'],
                  'ă': 'aw', 'ắ': ['aws', 'asw'], 'ằ': ['awf', 'afw'], 'ẵ': ['awx', 'axw'], 'ẳ': ['awr', 'arw'], 'ặ': ['awj', 'ajw'],
                  'ê': 'ee', 'ề': ['eef', 'efe'], 'ế': ['ees', 'ese'], 'ễ': ['eex', 'exe'], 'ể': ['eer', 'ere'], 'ệ': ['eej', 'eje'],
                  'é': 'es', 'è': 'ef', 'ẽ': 'ex', 'ẻ': 'er', 'ẹ': 'ej',
                  'ó': 'os', 'ò': 'of', 'õ': 'ox', 'ỏ': 'or', 'ọ': 'oj',
                  'ô': 'oo', 'ồ': ['oof', 'ofo'], 'ộ': ['ooj', 'ojo'], 'ổ': ['oor', 'oro'], 'ỗ': ['oox', 'oxo'], 'ố': ['oos', 'oso'],
                  'ơ': 'ow', 'ớ': ['ows', 'osw'], 'ờ': ['owf', 'ofw'], 'ở': ['owr', 'orw'], 'ợ': ['owj', 'ojw'], 'ỡ': ['owx', 'oxw'],
                  'ụ': 'uj', 'ú': 'us', 'ũ': 'ux', 'ủ': 'ur', 'ù': 'uf',
                  'ư': 'uw', 'ứ': ['uws', 'usw'], 'ừ': ['uwf', 'ufw'], 'ữ': ['uwx', 'uxw'], 'ử': ['uwr', 'urw'], 'ự': ['uwj', 'ujw'],
                  'ý': 'ys', 'ỳ': 'yf', 'ỷ': 'yr', 'ỹ': 'yx', 'ỵ': 'yj',
                  'í': 'is', 'ì': 'if', 'ĩ': 'ix', 'ỉ': 'ir', 'ị': 'ij',
                  'đ': 'dd'}
    # 67
    # viet moi dau o cuoi
    noise_tele2 = {'à': ['a', 'f'], 'á': ['a', 's'], 'ã': ['a', 'x'], 'ạ': ['a', 'j'], 'ả': ['a', 'r'],
                   'â': 'aa', 'ấ': ['aa', 's'], 'ầ': ['aa', 'f'], 'ẫ': ['aa', 'x'], 'ẩ': ['aa', 'r'], 'ậ': ['aa', 'j'],
                   'ă': 'aw', 'ắ': ['aw', 's'], 'ằ': ['aw', 'f'], 'ẵ': ['aw', 'x'], 'ẳ': ['aw', 'r'], 'ặ': ['aw', 'j'],
                   'ê': 'ee', 'ề': ['ee', 'f'], 'ế': ['ee', 's'], 'ễ': ['ee', 'x'], 'ể': ['ee', 'r'], 'ệ': ['ee', 'j'],
                   'é': ['e', 's'], 'è': ['e', 'f'], 'ẽ': ['e', 'x'], 'ẻ': ['e', 'r'], 'ẹ': ['e', 'j'],
                   'ó': ['o', 's'], 'ò': ['o', 'f'], 'õ': ['o', 'x'], 'ỏ': ['o', 'r'], 'ọ': ['o', 'j'],
                   'ô': 'oo', 'ồ': ['oo', 'f'], 'ộ': ['oo', 'j'], 'ổ': ['oo', 'r'], 'ỗ': ['oo', 'x'], 'ố': ['oo', 's'],
                   'ơ': 'ow', 'ớ': ['ow', 's'], 'ờ': ['ow', 'f'], 'ở': ['ow', 'r'], 'ợ': ['ow', 'j'], 'ỡ': ['ow', 'x'],
                   'ụ': ['u', 'j'], 'ú': ['u', 's'], 'ũ': ['u', 'x'], 'ủ': ['u', 'r'], 'ù': ['u', 'f'],
                   'ư': 'uw', 'ứ': ['uw', 's'], 'ừ': ['uw', 'f'], 'ữ': ['uw', 'x'], 'ử': ['uw', 'r'], 'ự': ['uw', 'j'],
                   'ý': ['y', 's'], 'ỳ': ['y', 'f'], 'ỷ': ['y', 'r'], 'ỹ': ['y', 'x'], 'ỵ': ['y', 'j'],
                   'í': ['i', 's'], 'ì': ['i', 'f'], 'ĩ': ['i', 'x'], 'ỉ': ['i', 'r'], 'ị': ['i', 'j'],
                   'đ': 'dd'}

    # viet day du tai cuoi

    noise_tele3 = {'à': ['a', 'f'], 'á': ['a', 's'], 'ã': ['a', 'x'], 'ạ': ['a', 'j'], 'ả': ['a', 'r'],
                   'â': ['a', 'a'], 'ấ': ['a', 'as', 'sa'], 'ầ': ['a', 'af', 'fa'], 'ẫ': ['a', 'ax', 'xa'], 'ẩ': ['a', 'ar', 'ra'], 'ậ': ['a', 'aj', 'ja'],
                   'ă': ['a', 'w'], 'ắ': ['a', 'ws', 'sw'], 'ằ': ['a', 'wf', 'fw'], 'ẵ': ['a', 'wx', 'xw'], 'ẳ': ['a', 'wr', 'rw'], 'ặ': ['a', 'wj', 'jw'],
                   'ê': ['e', 'e'], 'ề': ['e', 'ef', 'fe'], 'ế': ['e', 'es', 'se'], 'ễ': ['e', 'ex', 'xe'], 'ể': ['e', 'er', 're'], 'ệ': ['e', 'ej', 'je'],
                   'é': ['e', 's'], 'è': ['e', 'f'], 'ẽ': ['e', 'x'], 'ẻ': ['e', 'r'], 'ẹ': ['e', 'j'],
                   'ó': ['o', 's'], 'ò': ['o', 'f'], 'õ': ['o', 'x'], 'ỏ': ['o', 'r'], 'ọ': ['o', 'j'],
                   'ô': ['o', 'o'], 'ồ': ['o', 'of', 'fo'], 'ộ': ['o', 'oj', 'jo'], 'ổ': ['o', 'or', 'ro'], 'ỗ': ['o', 'ox', 'xo'], 'ố': ['o', 'os', 'so'],
                   'ơ': ['o', 'w'], 'ớ': ['o', 'ws', 'sw'], 'ờ': ['o', 'wf', 'fw'], 'ở': ['o', 'wr', 'rw'], 'ợ': ['o', 'wj', 'jw'], 'ỡ': ['o', 'wx', 'xw'],
                   'ụ': ['u', 'j'], 'ú': ['u', 's'], 'ũ': ['u', 'x'], 'ủ': ['u', 'r'], 'ù': ['u', 'f'],
                   'ư': ['u', 'w'], 'ứ': ['u', 'ws', 'sw'], 'ừ': ['u', 'wf', 'fw'], 'ữ': ['u', 'wx', 'xw'], 'ử': ['u', 'wr', 'rw'], 'ự': ['u', 'wj', 'jw'],
                   'ý': ['y', 's'], 'ỳ': ['y', 'f'], 'ỷ': ['y', 'r'], 'ỹ': ['y', 'x'], 'ỵ': ['y', 'j'],
                   'í': ['i', 's'], 'ì': ['i', 'f'], 'ĩ': ['i', 'x'], 'ỉ': ['i', 'r'], 'ị': ['i', 'j'],
                   'đ': ['d', 'd']}
    noise_list = []
    tmp1 = copy.copy(noise_tele[word])
    tmp2 = copy.copy(noise_tele2[word])
    tmp3 = copy.copy(noise_tele3[word])
    noise_list.append(tmp1)
    noise_list.append(tmp2)
    noise_list.append(tmp3)
    # print(noise_list)
    # return random.choice(noise_list)
    return noise_list


def noise_vni(word):
    # cach 1: viet day du dau tai cho
    noise_vni1 = {'à': 'a2', 'á': 'a1', 'ã': 'a4', 'ạ': 'a5', 'ả': 'a3',
                  'â': 'a6', 'ấ': ['a61', 'a16'], 'ầ': ['a62', 'a26'], 'ẫ': ['a64', 'a46'], 'ẩ': ['a63', 'a36'], 'ậ': ['a65', 'a56'],
                  'ă': 'a8', 'ắ': ['a81', 'a18'], 'ằ': ['a82', 'a28'], 'ẵ': ['a84', 'a48'], 'ẳ': ['a83', 'a38'], 'ặ': ['a85', 'a58'],
                  'ê': 'e6', 'ề': ['e62', 'e62'], 'ế': ['e61', 'e16'], 'ễ': ['e64', 'e46'], 'ể': ['e63', 'e36'], 'ệ': ['e65', 'e56'],
                  'é': 'e1', 'è': 'e2', 'ẽ': 'e4', 'ẻ': 'e3', 'ẹ': 'e5',
                  'ó': 'o1', 'ò': 'o2', 'õ': 'o4', 'ỏ': 'o3', 'ọ': 'o5',
                  'ô': 'o6', 'ồ': ['o62', 'o26'], 'ộ': ['o65', 'o56'], 'ổ': ['o63', 'o36'], 'ỗ': ['o64', 'o46'], 'ố': ['o61', 'o16'],
                  'ơ': 'o7', 'ớ': ['o71', 'o17'], 'ờ': ['o72', 'o27'], 'ở': ['o73', 'o37'], 'ợ': ['o75', 'o57'], 'ỡ': ['o74', 'o47'],
                  'ụ': 'u5', 'ú': 'u1', 'ũ': 'u4', 'ủ': 'u3', 'ù': 'u2',
                  'ư': 'u7', 'ứ': ['u71', 'u17'], 'ừ': ['u72', 'u27'], 'ữ': ['u74', 'u47'], 'ử': ['u73', 'u37'], 'ự': ['u75', 'u57'],
                  'ý': 'y1', 'ỳ': 'y2', 'ỷ': 'y3', 'ỹ': 'y4', 'ỵ': 'y5',
                  'í': 'i1', 'ì': 'i2', 'ĩ': 'i4', 'ỉ': 'i3', 'ị': 'i5',
                  'đ': 'd9'}
    # 67
    # viet moi dau o cuoi
    noise_vni2 = {'à': ['a', '2'], 'á': ['a', '1'], 'ã': ['a', '4'], 'ạ': ['a', '5'], 'ả': ['a', '3'],
                  'â': 'a6', 'ấ': ['a6', '1'], 'ầ': ['a6', '2'], 'ẫ': ['a6', '4'], 'ẩ': ['a6', '3'], 'ậ': ['a6', '5'],
                  'ă': 'a8', 'ắ': ['a8', '1'], 'ằ': ['a8', '2'], 'ẵ': ['a8', '4'], 'ẳ': ['a8', '3'], 'ặ': ['a8', '5'],
                  'ê': 'e6', 'ề': ['e6', '2'], 'ế': ['e6', '1'], 'ễ': ['e6', '4'], 'ể': ['e6', '3'], 'ệ': ['e6', '5'],
                  'é': ['e', '1'], 'è': ['e', '2'], 'ẽ': ['e', '4'], 'ẻ': ['e', '3'], 'ẹ': ['e', '5'],
                  'ó': ['o', '1'], 'ò': ['o', '2'], 'õ': ['o', '4'], 'ỏ': ['o', '3'], 'ọ': ['o', '5'],
                  'ô': 'o6', 'ồ': ['o6', '2'], 'ộ': ['o6', '5'], 'ổ': ['o6', '3'], 'ỗ': ['o6', '4'], 'ố': ['o6', '1'],
                  'ơ': 'o7', 'ớ': ['o7', '1'], 'ờ': ['o7', '2'], 'ở': ['o7', '3'], 'ợ': ['o7', '5'], 'ỡ': ['o7', '4'],
                  'ụ': ['u', '5'], 'ú': ['u', '1'], 'ũ': ['u', '4'], 'ủ': ['u', '3'], 'ù': ['u', '2'],
                  'ư': 'u7', 'ứ': ['u7', '1'], 'ừ': ['u7', '2'], 'ữ': ['u7', '4'], 'ử': ['u7', '3'], 'ự': ['u7', '5'],
                  'ý': ['y', '1'], 'ỳ': ['y', '2'], 'ỷ': ['y', '3'], 'ỹ': ['y', '4'], 'ỵ': ['y', '5'],
                  'í': ['i', '1'], 'ì': ['i', '2'], 'ĩ': ['i', '4'], 'ỉ': ['i', '3'], 'ị': ['i', '5'],
                  'đ': 'd9'}
    # viet day du tai cuoi

    noise_vni3 = {'à': ['a', '2'], 'á': ['a', '1'], 'ã': ['a', '4'], 'ạ': ['a', '5'], 'ả': ['a', '3'],
                  'â': ['a', '6'], 'ấ': ['a', '61', '16'], 'ầ': ['a', '62', '26'], 'ẫ': ['a', '64', '46'], 'ẩ': ['a', '63', '36'], 'ậ': ['a', '65', '56'],
                  'ă': ['a', '8'], 'ắ': ['a', '81', '18'], 'ằ': ['a', '82', '28'], 'ẵ': ['a', '84', '48'], 'ẳ': ['a', '83', '38'], 'ặ': ['a', '85', '58'],
                  'ê': ['e', '6'], 'ề': ['e', '62', '26'], 'ế': ['e', '61', '16'], 'ễ': ['e', '64', '46'], 'ể': ['e', '63', '36'], 'ệ': ['e', '65', '56'],
                  'é': ['e', '1'], 'è': ['e', '2'], 'ẽ': ['e', '4'], 'ẻ': ['e', '3'], 'ẹ': ['e', '5'],
                  'ó': ['o', '1'], 'ò': ['o', '2'], 'õ': ['o', '4'], 'ỏ': ['o', '3'], 'ọ': ['o', '5'],
                  'ô': ['o', '6'], 'ồ': ['o', '62', '26'], 'ộ': ['o', '65', '56'], 'ổ': ['o', '63', '36'], 'ỗ': ['o', '64', '46'], 'ố': ['o', '61', '16'],
                  'ơ': ['o', '7'], 'ớ': ['o', '71', '17'], 'ờ': ['o', '72', '27'], 'ở': ['o', '73', '37'], 'ợ': ['o', '75', '57'], 'ỡ': ['o', '74', '47'],
                  'ụ': ['u', '5'], 'ú': ['u', '1'], 'ũ': ['u', '4'], 'ủ': ['u', '3'], 'ù': ['u', '2'],
                  'ư': ['u', '7'], 'ứ': ['u', '71', '17'], 'ừ': ['u', '72', '27'], 'ữ': ['u', '74', '47'], 'ử': ['u', '73', '37'], 'ự': ['u', '75', '57'],
                  'ý': ['y', '1'], 'ỳ': ['y', '2'], 'ỷ': ['y', '3'], 'ỹ': ['y', '4'], 'ỵ': ['y', '5'],
                  'í': ['i', '1'], 'ì': ['i', '2'], 'ĩ': ['i', '4'], 'ỉ': ['i', '3'], 'ị': ['i', '5'],
                  'đ': ['d', '9']}
    noise_list = []
    tmp1 = copy.copy(noise_vni1[word])
    tmp2 = copy.copy(noise_vni2[word])
    tmp3 = copy.copy(noise_vni3[word])
    noise_list.append(tmp1)
    noise_list.append(tmp2)
    noise_list.append(tmp3)
    # return random.choice(noise_list)
    return noise_list


def closely_pronunciation1(subword):
    init_consonants = {'l': ['n'], 'n': ['l'], 'ch': ['tr'], 'tr': ['ch'], 'x': ['s'], 's': ['x'], 'r': ['d', 'gi', 'v'],
                       'd': ['r', 'gi', 'v'], 'gi': ['r', 'd', 'v'], 'v': ['r', 'gi', 'd']}
    return init_consonants[subword]


def saigon_final3(word):
    exchange_3_character = {}
    exchange_3_character['inh'] = 'in'
    exchange_3_character['ênh'] = 'ên'
    exchange_3_character['iên'] = 'iêng'
    exchange_3_character['ươn'] = 'ương'
    exchange_3_character['uôn'] = 'uông'
    exchange_3_character['iêt'] = 'iêc'
    exchange_3_character['ươt'] = 'ươc'
    exchange_3_character['uôt'] = 'uôc'
    return exchange_3_character[word]


def saigon_final2(word):
    exchange_2_character = {}
    exchange_2_character['ăn'] = 'ăng'
    exchange_2_character['an'] = 'ang'
    exchange_2_character['ân'] = 'âng'
    exchange_2_character['ưn'] = 'ưng'
    exchange_2_character['ắt'] = 'ăc'
    exchange_2_character['ât'] = 'âc'
    exchange_2_character['ưt'] = 'ưc'
    exchange_2_character['ôn'] = 'ông'
    exchange_2_character['un'] = 'ung'
    exchange_2_character['ôt'] = 'ôc'
    exchange_2_character['ut'] = 'uc'
    return exchange_2_character[word]


def like_pronunciation2(subword):
    like_pronunciation_init = {'g': ['gh'], 'gh': ['g'],
                               'c': ['q', 'k'], 'q': ['c', 'k'], 'k': ['c', 'q'],
                               'ng': ['ngh'], 'ngh': ['ng']}
    return like_pronunciation_init[subword]


def consonant_digraphs(word):
    consonant_digraph = {'ch': 'hc', 'gh': 'hg', 'gi': 'ig', 'kh': 'hk',
                         'nh': 'hn', 'ng': 'gn', 'ph': 'hp', 'th': 'ht', 'tr': 'rt', 'qu': 'uq'}
    return consonant_digraph[word]


def consonant_trigraphs(word):
    consonant_trigraph = {'ngh': ['gnh', 'nhg']}
    return consonant_trigraph[word]